Revit 2027 API
BuiltInFailures.RoofFailures.UnusedSlopeArrow Property
 The tails of all slope arrows must lie on the roof boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnusedSlopeArrow { get; }
Public Shared ReadOnly Property UnusedSlopeArrow As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnusedSlopeArrow {
	FailureDefinitionId^ get ();
}
static member UnusedSlopeArrow : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace